In [1]:
import pandas as pd

In [2]:
people = {
    "first": [ 'Jane', 'John', 'Vadim', 'Jackie', 'Bruce'], 
    "last": [ 'Doe', 'Doe', 'Smart', 'Chan', 'Lee'], 
    "email": ['Jane@email.com', 'John@email.com', 'Vadim@email.com', 'Jackie@email.net', 'Bruce@email.net']
}

In [3]:
df = pd.DataFrame(people)
df

    first   last             email
0    Jane    Doe    Jane@email.com
1    John    Doe    John@email.com
2   Vadim  Smart   Vadim@email.com
3  Jackie   Chan  Jackie@email.net
4   Bruce    Lee   Bruce@email.net

In [4]:
df['first'] + ' ' + df['last']

0       Jane Doe
1       John Doe
2    Vadim Smart
3    Jackie Chan
4      Bruce Lee
dtype: object

In [5]:
df['full_name'] = df['first'] + ' ' + df['last']

In [6]:
df

    first   last             email    full_name
0    Jane    Doe    Jane@email.com     Jane Doe
1    John    Doe    John@email.com     John Doe
2   Vadim  Smart   Vadim@email.com  Vadim Smart
3  Jackie   Chan  Jackie@email.net  Jackie Chan
4   Bruce    Lee   Bruce@email.net    Bruce Lee

In [7]:
df.drop(columns=['first', 'last'])

              email    full_name
0    Jane@email.com     Jane Doe
1    John@email.com     John Doe
2   Vadim@email.com  Vadim Smart
3  Jackie@email.net  Jackie Chan
4   Bruce@email.net    Bruce Lee

In [8]:
df.drop(columns=['first', 'last'], inplace=True)
df

              email    full_name
0    Jane@email.com     Jane Doe
1    John@email.com     John Doe
2   Vadim@email.com  Vadim Smart
3  Jackie@email.net  Jackie Chan
4   Bruce@email.net    Bruce Lee

In [9]:
df['full_name'].str.split(' ')

0       [Jane, Doe]
1       [John, Doe]
2    [Vadim, Smart]
3    [Jackie, Chan]
4      [Bruce, Lee]
Name: full_name, dtype: object

In [10]:
df['full_name'].str.split(' ', expand=True)

        0      1
0    Jane    Doe
1    John    Doe
2   Vadim  Smart
3  Jackie   Chan
4   Bruce    Lee

In [11]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [12]:
df

              email    full_name   first   last
0    Jane@email.com     Jane Doe    Jane    Doe
1    John@email.com     John Doe    John    Doe
2   Vadim@email.com  Vadim Smart   Vadim  Smart
3  Jackie@email.net  Jackie Chan  Jackie   Chan
4   Bruce@email.net    Bruce Lee   Bruce    Lee

In [13]:
stars = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(stars)
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [14]:
df = pd.concat([df, df2], ignore_index=True)
df

                email    full_name   first    last
0      Jane@email.com     Jane Doe    Jane     Doe
1      John@email.com     John Doe    John     Doe
2     Vadim@email.com  Vadim Smart   Vadim   Smart
3    Jackie@email.net  Jackie Chan  Jackie    Chan
4     Bruce@email.net    Bruce Lee   Bruce     Lee
5  IronMan@avenge.com          NaN    Tony   Stark
6      Cap@avenge.com          NaN   Steve  Rogers

In [15]:
df.drop(6)

                email    full_name   first   last
0      Jane@email.com     Jane Doe    Jane    Doe
1      John@email.com     John Doe    John    Doe
2     Vadim@email.com  Vadim Smart   Vadim  Smart
3    Jackie@email.net  Jackie Chan  Jackie   Chan
4     Bruce@email.net    Bruce Lee   Bruce    Lee
5  IronMan@avenge.com          NaN    Tony  Stark

In [ ]:
df.drop(df[df[]])